In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [2]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [3]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [4]:
df[['w','z']]

          w         z
a  0.302665 -1.159119
b -0.134841  0.184502
c  0.807706  0.329646
d -0.497104  0.484752
e -0.116773  1.996652

In [5]:
df.iloc[2]

w    0.807706
x    0.072960
y    0.638787
z    0.329646
Name: c, dtype: float64

In [6]:
dat = [1,2,3,4]
nam = ['a','b','c','d']
pd.Series(data=dat,index=nam)

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
df["new"] = df['w'] + df['z']
df

          w         x         y         z       new
a  0.302665  1.693723 -1.706086 -1.159119 -0.856454
b -0.134841  0.390528  0.166905  0.184502  0.049661
c  0.807706  0.072960  0.638787  0.329646  1.137352
d -0.497104 -0.754070 -0.943406  0.484752 -0.012352
e -0.116773  1.901755  0.238127  1.996652  1.879879

In [8]:
df.drop("new",axis=1,inplace=True)

In [9]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [10]:
df[df['y']>0]

          w         x         y         z
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
e -0.116773  1.901755  0.238127  1.996652

In [11]:
a = np.array([1,2,3,4])
b = np.array([1,2,1,2])
a+b

array([2, 4, 4, 6])

In [12]:
states = "KA MH TN KL MP".split()
df["States"] = states
df

          w         x         y         z States
a  0.302665  1.693723 -1.706086 -1.159119     KA
b -0.134841  0.390528  0.166905  0.184502     MH
c  0.807706  0.072960  0.638787  0.329646     TN
d -0.497104 -0.754070 -0.943406  0.484752     KL
e -0.116773  1.901755  0.238127  1.996652     MP

In [13]:
df.set_index("States")

               w         x         y         z
States
KA      0.302665  1.693723 -1.706086 -1.159119
MH     -0.134841  0.390528  0.166905  0.184502
TN      0.807706  0.072960  0.638787  0.329646
KL     -0.497104 -0.754070 -0.943406  0.484752
MP     -0.116773  1.901755  0.238127  1.996652

In [14]:
df.head()

          w         x         y         z States
a  0.302665  1.693723 -1.706086 -1.159119     KA
b -0.134841  0.390528  0.166905  0.184502     MH
c  0.807706  0.072960  0.638787  0.329646     TN
d -0.497104 -0.754070 -0.943406  0.484752     KL
e -0.116773  1.901755  0.238127  1.996652     MP

In [28]:
da = df[df["States"]=="KA"]["w"]

In [37]:
da.get_value("a")

0.30266544858518252

In [39]:
df["w"].max()

0.8077059142577141

In [40]:
sal = pd.read_csv("Salaries.csv")

In [42]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [46]:
sal.groupby("Year")["BasePay"].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [52]:
sal["JobTitle"].nunique()

2159

In [69]:
sal["JobTitle"].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [108]:
sum(sal[sal["Year"]==2013]["JobTitle"].value_counts()==1)

202

In [114]:
def isChief(st):
    return "chief" in st.lower()
sum(sal["JobTitle"].apply(lambda x: isChief(x)))

627

In [119]:
sal['title_len'] = sal['JobTitle'].apply(len)
sal[['TotalPayBenefits','title_len']].corr()

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000

In [121]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 14 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
title_len           148654 non-null int64
dtypes: float64(8), int64(3), object(3)
memory usage: 15.9+ MB